{"modelTopology": {"keras_version": "2.0.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"name": "conv2d_1", "activity_regularizer": null, "trainable": true, "dtype": "float32", "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32, 32, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 128, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "units": 46, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"sample_weight_mode": null, "optimizer_config": {"config": {"lr": 1.0, "decay": 0.0, "epsilon": 1e-08, "rho": 0.95}, "class_name": "Adadelta"}, "loss_weights": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [2048, 1024], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [1024, 46], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [46], "dtype": "float32"}]}]}